Revit 2027 API
AreaReinforcement.GetBoundaryCurveIds Method
 Retrieves the set of curves forming the boundary of the Area Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetBoundaryCurveIds()
Public Function GetBoundaryCurveIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetBoundaryCurveIds()
member GetBoundaryCurveIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 A collection of ElementIds of AreaReinforcementCurve elements.
Remarks
 Each ElementId in the collection is an Id of an Element of type AreaReinforcementCurve. Each element has a Curve property to retrieve the geometric curve, together with some Parameters allowing the developer to override the clear cover side, hook type, and hook direction of each layer of bars terminating at the curve.
See Also
Reference
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace